Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "3x56a4" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.feedutopia-web will be updated in-place
~ resource "aws_cloudfront_distribution" "feedutopia-web" {
        id                              = "E2TI4KXVWXT68J"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:825765422855:function:sharedservices-edge-auth:2" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (2 unchanged blocks hidden)
        }

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:825765422855:function:sharedservices-edge-auth:2" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_iam_role_policy_attachment.edge_lambda_basic will be created
+ resource "aws_iam_role_policy_attachment" "edge_lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "sharedservices_edge_lambda_role"
    }

  # aws_lambda_function.edge_auth will be updated in-place
~ resource "aws_lambda_function" "edge_auth" {
        id                             = "sharedservices-edge-auth"
      ~ last_modified                  = "2025-05-22T23:21:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:825765422855:function:sharedservices-edge-auth:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:825765422855:function:sharedservices-edge-auth:2/invocations" -> (known after apply)
      ~ source_code_hash               = "0ezDzChWIL7BA5eSSMWwJlxmPrZYTW7jGcCkPQHHZQU=" -> "aYA94BZ2CX8/xdlCE4FtMwGWn0+Z5gg4H61blYk4hJ4="
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```